tiborsimon/embedded-tdd-headers/pic/8bit/pic18f4580_tdd.h
#define RXF14SIDH_SID3                522
#define RXF14SID4                     523
#define RXF14SIDH_SID4                524
#define RXF14SID5                     525
#define RXF14SIDH_SID5                526
#define RXF14SID6                     527
#define RXF14SIDH_SID6                528
#define RXF14SID7                     529
#define RXF14SIDH_SID7                530
#define RXF14SID8                     531
#define RXF14SIDH_SID8                532
#define RXF14SID9                     533
#define RXF14SIDH_SID9                534
#define RXF14SIDH_SID10               535
#define RXF14SID10                    536
#define RXF14SIDL                     537
#define RXF14SIDL_EID16               538
#define RXF14EID16                    539
#define RXF14SIDL_EID17               540
#define RXF14EID17                    541
#define RXF14SIDL_EXIDEN              542
#define RXF14EXIDEN                   543
#define RXF14SIDL_EXIDE               544
#define RXF14SID0                     545
#define RXF14SIDL_SID0                546
#define RXF14SID1                     547
#define RXF14SIDL_SID1                548
#define RXF14SID2                     549
#define RXF14SIDL_SID2                550
#define RXF14EIDH                     551
#define RXF14EID8                     552
#define RXF14EIDH_EID8                553
#define RXF14EID9                     554
#define RXF14EIDH_EID9                555
#define RXF14EID10                    556
#define RXF14EIDH_EID10               557
#define RXF14EID11                    558
#define RXF14EIDH_EID11               559
#define RXF14EID12                    560
#define RXF14EIDH_EID12               561
#define RXF14EID13                    562
#define RXF14EIDH_EID13               563
#define RXF14EID14                    564
#define RXF14EIDH_EID14               565
#define RXF14EID15                    566
#define RXF14EIDH_EID15               567
#define RXF14EIDL                     568
#define RXF14EIDL_EID0                569
#define RXF14EID0                     570
#define RXF14EIDL_EID1                571
#define RXF14EID1                     572
#define RXF14EIDL_EID2                573
#define RXF14EID2                     574
#define RXF14EIDL_EID3                575
#define RXF14EID3                     576
#define RXF14EIDL_EID4                577
#define RXF14EID4                     578
#define RXF14EIDL_EID5                579
#define RXF14EID5                     580
#define RXF14EIDL_EID6                581
#define RXF14EID6                     582
#define RXF14EIDL_EID7                583
#define RXF14EID7                     584
#define RXF15SIDH                     585
#define RXF15SID3                     586
#define RXF15SIDH_SID3                587
#define RXF15SID4                     588
#define RXF15SIDH_SID4                589
#define RXF15SID5                     590
#define RXF15SIDH_SID5                591
#define RXF15SID6                     592
#define RXF15SIDH_SID6                593
#define RXF15SID7                     594
#define RXF15SIDH_SID7                595
#define RXF15SID8                     596
#define RXF15SIDH_SID8                597
#define RXF15SID9                     598
#define RXF15SIDH_SID9                599
#define RXF15SID10                    600
#define RXF15SIDH_SID10               601
#define RXF15SIDL                     602
#define RXF15EID16                    603
#define RXF15SIDL_EID16               604
#define RXF15EID17                    605
#define RXF15SIDL_EID17               606
#define RXF15SIDL_EXIDEN              607
#define RXF15SIDL_EXIDE               608
#define RXF15EXIDEN                   609
#define RXF15SID0                     610
#define RXF15SIDL_SID0                611
#define RXF15SIDL_SID1                612
#define RXF15SID1                     613
#define RXF15SIDL_SID2                614
#define RXF15SID2                     615
#define RXF15EIDH                     616
#define RXF15EID8                     617
#define RXF15EIDH_EID8                618
#define RXF15EID9                     619
#define RXF15EIDH_EID9                620
#define RXF15EID10                    621
#define RXF15EIDH_EID10               622
#define RXF15EID11                    623
#define RXF15EIDH_EID11               624
#define RXF15EID12                    625
#define RXF15EIDH_EID12               626
#define RXF15EID13                    627
#define RXF15EIDH_EID13               628
#define RXF15EID14                    629
#define RXF15EIDH_EID14               630
#define RXF15EID15                    631
#define RXF15EIDH_EID15               632
#define RXF15EIDL                     633
#define RXF15EIDL_EID0                634
#define RXF15EID0                     635
#define RXF15EIDL_EID1                636
#define RXF15EID1                     637
#define RXF15EIDL_EID2                638
#define RXF15EID2                     639
#define RXF15EIDL_EID3                640
#define RXF15EID3                     641
#define RXF15EIDL_EID4                642
#define RXF15EID4                     643
#define RXF15EIDL_EID5                644
#define RXF15EID5                     645
#define RXF15EIDL_EID6                646
#define RXF15EID6                     647
#define RXF15EIDL_EID7                648
#define RXF15EID7                     649
#define RXFCON0                       650
#define RXF0EN                        651
#define RXF1EN                        652
#define RXF2EN                        653
#define RXF3EN                        654
#define RXF4EN                        655
#define RXF5EN                        656
#define RXF6EN                        657
#define RXF7EN                        658
#define RXFCON1                       659
#define RXF8EN                        660
#define RXF9EN                        661
#define RXF10EN                       662
#define RXF11EN                       663
#define RXF12EN                       664
#define RXF13EN                       665
#define RXF14EN                       666
#define RXF15EN                       667
#define SDFLC                         668
#define DFLC0                         669
#define FLC0                          670
#define DFLC1                         671
#define FLC1                          672
#define DFLC2                         673
#define FLC2                          674
#define DFLC3                         675
#define FLC3                          676
#define DFLC4                         677
#define FLC4                          678
#define RXFBCON0                      679
#define F0BP_01                       680
#define F0BP_0                        681
#define F0BP_1                        682
#define F0BP_2                        683
#define F0BP_3                        684
#define F1BP_0                        685
#define F1BP_1                        686
#define F1BP_2                        687
#define F1BP_3                        688
#define RXFBCON1                      689
#define F2BP_0                        690
#define F2BP_01                       691
#define F2BP_1                        692
#define F2BP_2                        693
#define F2BP_3                        694
#define F3BP_0                        695
#define F3BP_1                        696
#define F3BP_2                        697
#define F3BP_3                        698
#define RXFBCON2                      699
#define F4BP_0                        700
#define F4BP_01                       701
#define F4BP_1                        702
#define F4BP_2                        703
#define F4BP_3                        704
#define F5BP_0                        705
#define F5BP_1                        706
#define F5BP_2                        707
#define F5BP_3                        708
#define RXFBCON3                      709
#define F6BP_0                        710
#define F6BP_01                       711
#define F6BP_1                        712
#define F6BP_2                        713
#define F6BP_3                        714
#define F7BP_0                        715
#define F7BP_1                        716
#define F7BP_2                        717
#define F7BP_3                        718
#define RXFBCON4                      719
#define F8BP_0                        720
#define F8BP_01                       721
#define F8BP_1                        722
#define F8BP_2                        723
#define F8BP_3                        724
#define F9BP_0                        725
#define F9BP_1                        726
#define F9BP_2                        727
#define F9BP_3                        728
#define RXFBCON5                      729
#define F10BP_01                      730
#define F10BP_0                       731
#define F10BP_1                       732
#define F10BP_2                       733
#define F10BP_3                       734
#define F11BP_0                       735
#define F11BP_1                       736
#define F11BP_2                       737
#define F11BP_3                       738
#define RXFBCON6                      739
#define F12BP_01                      740
#define F12BP_0                       741
#define F12BP_1                       742
#define F12BP_2                       743
#define F12BP_3                       744
#define F13BP_0                       745
#define F13BP_1                       746
#define F13BP_2                       747
#define F13BP_3                       748
#define RXFBCON7                      749
#define F14BP_0                       750
#define F14BP_01                      751
#define F14BP_1                       752
#define F14BP_2                       753
#define F14BP_3                       754
#define F15BP_0                       755
#define F15BP_1                       756
#define F15BP_2                       757
#define F15BP_3                       758
#define MSEL0                         759
#define FIL0_0                        760
#define FIL0_1                        761
#define FIL1_0                        762
#define FIL1_1                        763
#define FIL2_0                        764
#define FIL2_1                        765
#define FIL3_0                        766
#define FIL3_1                        767
#define MSEL1                         768
#define FIL4_0                        769
#define FIL4_1                        770
#define FIL5_0                        771
#define FIL5_1                        772
#define FIL6_0                        773
#define FIL6_1                        774
#define FIL7_0                        775
#define FIL7_1                        776
#define MSEL2                         777
#define FIL8_0                        778
#define FIL8_1                        779
#define FIL9_0                        780
#define FIL9_1                        781
#define FIL10_0                       782
#define FIL10_1                       783
#define FIL11_0                       784
#define FIL11_1                       785
#define MSEL3                         786
#define FIL12_0                       787
#define FIL12_1                       788
#define FIL13_0                       789
#define FIL13_1                       790
#define FIL14_0                       791
#define FIL14_1                       792
#define FIL15_0                       793
#define FIL15_1                       794
#define BSEL0                         795
#define B0TXEN                        796
#define B1TXEN                        797
#define B2TXEN                        798
#define B3TXEN                        799
#define B4TXEN                        800
#define B5TXEN                        801
#define BIE0                          802
#define BIE0_RXB0IE                   803
#define DRXB0IE                       804
#define BIE0_RXB1IE                   805
#define DRXB1IE                       806
#define B0IE                          807
#define B1IE                          808
#define B2IE                          809
#define B3IE                          810
#define B4IE                          811
#define B5IE                          812
#define TXBIE                         813
#define TX0IE                         814
#define TXBIE_TXB0IE                  815
#define TXBIE_TXB1IE                  816
#define TXBIE_TX1IE                   817
#define TX2IE                         818
#define TXBIE_TXB2IE                  819
#define B0CON                         820
#define B0CON_TXPRI0                  821
#define B0FILHIT0                     822
#define B0CON_FILHIT0_TXPRI0          823
#define B0CON_FILHIT0                 824
#define B0TXPRI0                      825
#define B0FILHIT1                     826
#define B0CON_TXPRI1                  827
#define B0TXPRI1                      828
#define B0CON_FILHIT1                 829
#define B0CON_FILHIT1_TXPRI1          830
#define B0FILHIT2                     831
#define B0CON_RTREN                   832
#define B0CON_FILHIT2_RTREN           833
#define B0CON_FILHIT2                 834
#define B0RTREN                       835
#define B0FILHIT3                     836
#define B0CON_TXREQ                   837
#define B0TXREQ                       838
#define B0CON_FILHIT3                 839
#define B0CON_FILHIT3_TXREQ           840
#define B0FILHIT4                     841
#define B0CON_TXERR                   842
#define B0CON_FILHIT4                 843
#define B0TXERR                       844
#define B0CON_FILHIT4_TXERR           845
#define B0CON_RXRTRRO                 846
#define B0CON_RTRRO                   847
#define B0TXLARB                      848
#define B0RTRRO                       849
#define B0CON_RXRTRRO_TXLARB          850
#define B0CON_TXLARB                  851
#define B0CON_RXM1_TXABT              852
#define B0CON_TXABT                   853
#define B0RXM1                        854
#define B0TXABT                       855
#define B0CON_RXM1                    856
#define B0CON_RXFUL                   857
#define B0CON_RXFUL_TXBIF             858
#define B0RXFUL                       859
#define B0CON_TXBIF                   860
#define B0TXB3IF                      861
#define B0SIDH                        862
#define B0SIDH_SID3                   863
#define B0SID3                        864
#define B0SIDH_SID4                   865
#define B0SID4                        866
#define B0SIDH_SID5                   867
#define B0SID5                        868
#define B0SIDH_SID6                   869
#define B0SID6                        870
#define B0SIDH_SID7                   871
#define B0SID7                        872
#define B0SIDH_SID8                   873
#define B0SID8                        874
#define B0SIDH_SID9                   875
#define B0SID9                        876
#define B0SIDH_SID10                  877
#define B0SID10                       878
#define B0SIDL                        879
#define B0SIDL_EID16                  880
#define B0EID16                       881
#define B0SIDL_EID17                  882
#define B0EID17                       883
#define B0SIDL_EXID                   884
#define B0SIDL_EXIDE                  885
#define B0EXID                        886
#define B0SIDL_SRR                    887
#define B0SRR                         888
#define B0SID0                        889
#define B0SIDL_SID0                   890
#define B0SID1                        891
#define B0SIDL_SID1                   892
#define B0SID2                        893
#define B0SIDL_SID2                   894
#define B0EIDH                        895
#define B0EID8                        896
#define B0EIDH_EID8                   897
#define B0EID9                        898
#define B0EIDH_EID9                   899
#define B0EID10                       900
#define B0EIDH_EID10                  901
#define B0EID11                       902
#define B0EIDH_EID11                  903
#define B0EID12                       904
#define B0EIDH_EID12                  905
#define B0EID13                       906
#define B0EIDH_EID13                  907
#define B0EID14                       908
#define B0EIDH_EID14                  909
#define B0EID15                       910
#define B0EIDH_EID15                  911
#define B0EIDL                        912
#define B0EID0                        913
#define B0EIDL_EID0                   914
#define B0EID1                        915
#define B0EIDL_EID1                   916
#define B0EID2                        917
#define B0EIDL_EID2                   918
#define B0EID3                        919
#define B0EIDL_EID3                   920
#define B0EID4                        921
#define B0EIDL_EID4                   922
#define B0EID5                        923
#define B0EIDL_EID5                   924
#define B0EID6                        925
#define B0EIDL_EID6                   926
#define B0EID7                        927
#define B0EIDL_EID7                   928
#define B0DLC                         929
#define B0DLC_DLC0                    930
#define B0DLC0                        931
#define B0DLC_DLC1                    932
#define B0DLC1                        933
#define B0DLC_DLC2                    934
#define B0DLC2                        935
#define B0DLC_DLC3                    936
#define B0DLC3                        937
#define B0DLC_RB0                     938
#define B0RB0                         939
#define B0DLC_RESRB0                  940
#define B0DLC_RB1                     941
#define B0RB1                         942
#define B0DLC_RESRB1                  943
#define B0DLC_RXRTR_TXRTR             944
#define B0RXRTR                       945
#define B0DLC_RXRTR                   946
#define B0DLC_TXRTR                   947
#define B0D0                          948
#define B0D00                         949
#define B0D01                         950
#define B0D02                         951
#define B0D03                         952
#define B0D04                         953
#define B0D05                         954
#define B0D06                         955
#define B0D07                         956
#define B0D1                          957
#define B0D10                         958
#define B0D11                         959
#define B0D12                         960
#define B0D13                         961
#define B0D14                         962
#define B0D15                         963
#define B0D16                         964
#define B0D17                         965
#define B0D2                          966
#define B0D20                         967
#define B0D21                         968
#define B0D22                         969
#define B0D23                         970
#define B0D24                         971
#define B0D25                         972
#define B0D26                         973
#define B0D27                         974
#define B0D3                          975
#define B0D30                         976
#define B0D31                         977
#define B0D32                         978
#define B0D33                         979
#define B0D34                         980
#define B0D35                         981
#define B0D36                         982
#define B0D37                         983
#define B0D4                          984
#define B0D40                         985
#define B0D41                         986
#define B0D42                         987
#define B0D43                         988
#define B0D44                         989
#define B0D45                         990
#define B0D46                         991
#define B0D47                         992
#define B0D5                          993
#define B0D50                         994
#define B0D51                         995
#define B0D52                         996
#define B0D53                         997
#define B0D54                         998
#define B0D55                         999
#define B0D56                         1000
#define B0D57                         1001
#define B0D6                          1002
#define B0D60                         1003
#define B0D61                         1004
#define B0D62                         1005
#define B0D63                         1006
#define B0D64                         1007
#define B0D65                         1008
#define B0D66                         1009
#define B0D67                         1010
#define B0D7                          1011
#define B0D70                         1012
#define B0D71                         1013
#define B0D72                         1014
#define B0D73                         1015
#define B0D74                         1016
#define B0D75                         1017
#define B0D76                         1018
#define B0D77                         1019
#define CANSTAT_RO9                   1020
#define CANSTAT_RO9_ICODE0            1021
#define CANSTAT_RO9_EICODE0           1022
#define CANSTAT_RO9_ICODE1            1023
#define CANSTAT_RO9_EICODE1_ICODE0    1024
#define CANSTAT_RO9_ICODE2            1025
#define CANSTAT_RO9_EICODE2_ICODE1    1026
#define CANSTAT_RO9_ICODE3            1027
#define CANSTAT_RO9_EICODE3_ICODE2    1028
#define CANSTAT_RO9_ICODE4            1029
#define CANSTAT_RO9_EICODE4           1030
#define CANSTAT_RO9_OPMODE0           1031
#define CANSTAT_RO9_OPMODE1           1032
#define CANSTAT_RO9_OPMODE2           1033
#define CANCON_RO9                    1034
#define CANCON_RO9_FP0                1035
#define CANCON_RO9_WIN0               1036
#define CANCON_RO9_WIN0_FP1           1037
#define CANCON_RO9_WIN1_FP2           1038
#define CANCON_RO9_WIN1               1039
#define CANCON_RO9_WIN2_FP3           1040
#define CANCON_RO9_WIN2               1041
#define CANCON_RO9_ABAT               1042
#define CANCON_RO9_REQOP0             1043
#define CANCON_RO9_REQOP1             1044
#define CANCON_RO9_REQOP2             1045
#define B1CON                         1046
#define B1CON_FILHIT0                 1047
#define B1CON_TXPRI0                  1048
#define B1CON_FILHIT0_TXPRI0          1049
#define B1FILHIT0                     1050
#define B1TXPRI0                      1051
#define B1CON_FILHIT1                 1052
#define B1CON_FILHIT1_TXPRI1          1053
#define B1CON_TXPRI1                  1054
#define B1FILHIT1                     1055
#define B1TXPRI1                      1056
#define B1CON_FILHIT2                 1057
#define B1RTREN                       1058
#define B1CON_RTREN                   1059
#define B1FILHIT2                     1060
#define B1CON_FILHIT2_RTREN           1061
#define B1CON_FILHIT3                 1062
#define B1TXREQ                       1063
#define B1CON_TXREQ                   1064
#define B1CON_FILHIT3_TXREQ           1065
#define B1FILHIT3                     1066
#define B1CON_FILHIT4                 1067
#define B1CON_FILHIT4_TXERR           1068
#define B1TXERR                       1069
#define B1FILHIT4                     1070
#define B1CON_TXERR                   1071
#define B1CON_RXRTRRO_TXLARB          1072
#define B1CON_TXLARB                  1073
#define B1CON_RTRRO                   1074
#define B1TXLARB                      1075
#define B1CON_RXRTRRO                 1076
#define B1RTRRO                       1077
#define B1CON_TXABT                   1078
#define B1CON_RXM1                    1079
#define B1RXM1                        1080
#define B1CON_RXM1_TXABT              1081
#define B1TXABT                       1082
#define B1RXFUL                       1083
#define B1CON_RXFUL                   1084
#define B1TXB3IF                      1085
#define B1CON_TXBIF                   1086
#define B1CON_RXFUL_TXBIF             1087
#define B1SIDH                        1088
#define B1SIDH_SID3                   1089
#define B1SID3                        1090
