tiborsimon/embedded-tdd-headers/pic/8bit/pic18f4580_tdd.h
#define RXF0SIDL_EXIDEN               2207
#define RXF0SID0                      2208
#define RXF0SIDL_SID0                 2209
#define RXF0SIDL_SID1                 2210
#define RXF0SID1                      2211
#define RXF0SID2                      2212
#define RXF0SIDL_SID2                 2213
#define RXF0EIDH                      2214
#define RXF0EIDH_EID8                 2215
#define RXF0EID8                      2216
#define RXF0EIDH_EID9                 2217
#define RXF0EID9                      2218
#define RXF0EIDH_EID10                2219
#define RXF0EID10                     2220
#define RXF0EIDH_EID11                2221
#define RXF0EID11                     2222
#define RXF0EIDH_EID12                2223
#define RXF0EID12                     2224
#define RXF0EIDH_EID13                2225
#define RXF0EID13                     2226
#define RXF0EIDH_EID14                2227
#define RXF0EID14                     2228
#define RXF0EIDH_EID15                2229
#define RXF0EID15                     2230
#define RXF0EIDL                      2231
#define RXF0EIDL_EID0                 2232
#define RXF0EID0                      2233
#define RXF0EIDL_EID1                 2234
#define RXF0EID1                      2235
#define RXF0EIDL_EID2                 2236
#define RXF0EID2                      2237
#define RXF0EIDL_EID3                 2238
#define RXF0EID3                      2239
#define RXF0EIDL_EID4                 2240
#define RXF0EID4                      2241
#define RXF0EIDL_EID5                 2242
#define RXF0EID5                      2243
#define RXF0EIDL_EID6                 2244
#define RXF0EID6                      2245
#define RXF0EIDL_EID7                 2246
#define RXF0EID7                      2247
#define RXF1SIDH                      2248
#define RXF1SID3                      2249
#define RXF1SIDH_SID3                 2250
#define RXF1SID4                      2251
#define RXF1SIDH_SID4                 2252
#define RXF1SID5                      2253
#define RXF1SIDH_SID5                 2254
#define RXF1SID6                      2255
#define RXF1SIDH_SID6                 2256
#define RXF1SID7                      2257
#define RXF1SIDH_SID7                 2258
#define RXF1SID8                      2259
#define RXF1SIDH_SID8                 2260
#define RXF1SID9                      2261
#define RXF1SIDH_SID9                 2262
#define RXF1SIDH_SID10                2263
#define RXF1SID10                     2264
#define RXF1SIDL                      2265
#define RXF1SIDL_EID16                2266
#define RXF1EID16                     2267
#define RXF1SIDL_EID17                2268
#define RXF1EID17                     2269
#define RXF1EXIDEN                    2270
#define RXF1SIDL_EXIDE                2271
#define RXF1SIDL_EXIDEN               2272
#define RXF1SIDL_SID0                 2273
#define RXF1SID0                      2274
#define RXF1SIDL_SID1                 2275
#define RXF1SID1                      2276
#define RXF1SID2                      2277
#define RXF1SIDL_SID2                 2278
#define RXF1EIDH                      2279
#define RXF1EID8                      2280
#define RXF1EIDH_EID8                 2281
#define RXF1EID9                      2282
#define RXF1EIDH_EID9                 2283
#define RXF1EIDH_EID10                2284
#define RXF1EID10                     2285
#define RXF1EIDH_EID11                2286
#define RXF1EID11                     2287
#define RXF1EIDH_EID12                2288
#define RXF1EID12                     2289
#define RXF1EIDH_EID13                2290
#define RXF1EID13                     2291
#define RXF1EIDH_EID14                2292
#define RXF1EID14                     2293
#define RXF1EIDH_EID15                2294
#define RXF1EID15                     2295
#define RXF1EIDL                      2296
#define RXF1EID0                      2297
#define RXF1EIDL_EID0                 2298
#define RXF1EID1                      2299
#define RXF1EIDL_EID1                 2300
#define RXF1EID2                      2301
#define RXF1EIDL_EID2                 2302
#define RXF1EID3                      2303
#define RXF1EIDL_EID3                 2304
#define RXF1EID4                      2305
#define RXF1EIDL_EID4                 2306
#define RXF1EID5                      2307
#define RXF1EIDL_EID5                 2308
#define RXF1EID6                      2309
#define RXF1EIDL_EID6                 2310
#define RXF1EIDL_EID7                 2311
#define RXF1EID7                      2312
#define RXF2SIDH                      2313
#define RXF2SID3                      2314
#define RXF2SIDH_SID3                 2315
#define RXF2SID4                      2316
#define RXF2SIDH_SID4                 2317
#define RXF2SID5                      2318
#define RXF2SIDH_SID5                 2319
#define RXF2SID6                      2320
#define RXF2SIDH_SID6                 2321
#define RXF2SID7                      2322
#define RXF2SIDH_SID7                 2323
#define RXF2SID8                      2324
#define RXF2SIDH_SID8                 2325
#define RXF2SID9                      2326
#define RXF2SIDH_SID9                 2327
#define RXF2SID10                     2328
#define RXF2SIDH_SID10                2329
#define RXF2SIDL                      2330
#define RXF2SIDL_EID16                2331
#define RXF2EID16                     2332
#define RXF2SIDL_EID17                2333
#define RXF2EID17                     2334
#define RXF2SIDL_EXIDE                2335
#define RXF2EXIDEN                    2336
#define RXF2SIDL_EXIDEN               2337
#define RXF2SID0                      2338
#define RXF2SIDL_SID0                 2339
#define RXF2SID1                      2340
#define RXF2SIDL_SID1                 2341
#define RXF2SID2                      2342
#define RXF2SIDL_SID2                 2343
#define RXF2EIDH                      2344
#define RXF2EID8                      2345
#define RXF2EIDH_EID8                 2346
#define RXF2EID9                      2347
#define RXF2EIDH_EID9                 2348
#define RXF2EID10                     2349
#define RXF2EIDH_EID10                2350
#define RXF2EIDH_EID11                2351
#define RXF2EID11                     2352
#define RXF2EIDH_EID12                2353
#define RXF2EID12                     2354
#define RXF2EIDH_EID13                2355
#define RXF2EID13                     2356
#define RXF2EIDH_EID14                2357
#define RXF2EID14                     2358
#define RXF2EIDH_EID15                2359
#define RXF2EID15                     2360
#define RXF2EIDL                      2361
#define RXF2EID0                      2362
#define RXF2EIDL_EID0                 2363
#define RXF2EID1                      2364
#define RXF2EIDL_EID1                 2365
#define RXF2EID2                      2366
#define RXF2EIDL_EID2                 2367
#define RXF2EID3                      2368
#define RXF2EIDL_EID3                 2369
#define RXF2EID4                      2370
#define RXF2EIDL_EID4                 2371
#define RXF2EID5                      2372
#define RXF2EIDL_EID5                 2373
#define RXF2EID6                      2374
#define RXF2EIDL_EID6                 2375
#define RXF2EID7                      2376
#define RXF2EIDL_EID7                 2377
#define RXF3SIDH                      2378
#define RXF3SID3                      2379
#define RXF3SIDH_SID3                 2380
#define RXF3SIDH_SID4                 2381
#define RXF3SID4                      2382
#define RXF3SIDH_SID5                 2383
#define RXF3SID5                      2384
#define RXF3SIDH_SID6                 2385
#define RXF3SID6                      2386
#define RXF3SIDH_SID7                 2387
#define RXF3SID7                      2388
#define RXF3SIDH_SID8                 2389
#define RXF3SID8                      2390
#define RXF3SIDH_SID9                 2391
#define RXF3SID9                      2392
#define RXF3SID10                     2393
#define RXF3SIDH_SID10                2394
#define RXF3SIDL                      2395
#define RXF3SIDL_EID16                2396
#define RXF3EID16                     2397
#define RXF3EID17                     2398
#define RXF3SIDL_EID17                2399
#define RXF3SIDL_EXIDE                2400
#define RXF3SIDL_EXIDEN               2401
#define RXF3EXIDEN                    2402
#define RXF3SIDL_SID0                 2403
#define RXF3SID0                      2404
#define RXF3SIDL_SID1                 2405
#define RXF3SID1                      2406
#define RXF3SIDL_SID2                 2407
#define RXF3SID2                      2408
#define RXF3EIDH                      2409
#define RXF3EIDH_EID8                 2410
#define RXF3EID8                      2411
#define RXF3EIDH_EID9                 2412
#define RXF3EID9                      2413
#define RXF3EIDH_EID10                2414
#define RXF3EID10                     2415
#define RXF3EIDH_EID11                2416
#define RXF3EID11                     2417
#define RXF3EIDH_EID12                2418
#define RXF3EID12                     2419
#define RXF3EIDH_EID13                2420
#define RXF3EID13                     2421
#define RXF3EIDH_EID14                2422
#define RXF3EID14                     2423
#define RXF3EIDH_EID15                2424
#define RXF3EID15                     2425
#define RXF3EIDL                      2426
#define RXF3EID0                      2427
#define RXF3EIDL_EID0                 2428
#define RXF3EID1                      2429
#define RXF3EIDL_EID1                 2430
#define RXF3EID2                      2431
#define RXF3EIDL_EID2                 2432
#define RXF3EID3                      2433
#define RXF3EIDL_EID3                 2434
#define RXF3EID4                      2435
#define RXF3EIDL_EID4                 2436
#define RXF3EID5                      2437
#define RXF3EIDL_EID5                 2438
#define RXF3EID6                      2439
#define RXF3EIDL_EID6                 2440
#define RXF3EID7                      2441
#define RXF3EIDL_EID7                 2442
#define RXF4SIDH                      2443
#define RXF4SID3                      2444
#define RXF4SIDH_SID3                 2445
#define RXF4SID4                      2446
#define RXF4SIDH_SID4                 2447
#define RXF4SID5                      2448
#define RXF4SIDH_SID5                 2449
#define RXF4SID6                      2450
#define RXF4SIDH_SID6                 2451
#define RXF4SID7                      2452
#define RXF4SIDH_SID7                 2453
#define RXF4SID8                      2454
#define RXF4SIDH_SID8                 2455
#define RXF4SID9                      2456
#define RXF4SIDH_SID9                 2457
#define RXF4SIDH_SID10                2458
#define RXF4SID10                     2459
#define RXF4SIDL                      2460
#define RXF4EID16                     2461
#define RXF4SIDL_EID16                2462
#define RXF4EID17                     2463
#define RXF4SIDL_EID17                2464
#define RXF4SIDL_EXIDE                2465
#define RXF4SIDL_EXIDEN               2466
#define RXF4EXIDEN                    2467
#define RXF4SID0                      2468
#define RXF4SIDL_SID0                 2469
#define RXF4SIDL_SID1                 2470
#define RXF4SID1                      2471
#define RXF4SID2                      2472
#define RXF4SIDL_SID2                 2473
#define RXF4EIDH                      2474
#define RXF4EID8                      2475
#define RXF4EIDH_EID8                 2476
#define RXF4EID9                      2477
#define RXF4EIDH_EID9                 2478
#define RXF4EID10                     2479
#define RXF4EIDH_EID10                2480
#define RXF4EID11                     2481
#define RXF4EIDH_EID11                2482
#define RXF4EID12                     2483
#define RXF4EIDH_EID12                2484
#define RXF4EID13                     2485
#define RXF4EIDH_EID13                2486
#define RXF4EID14                     2487
#define RXF4EIDH_EID14                2488
#define RXF4EID15                     2489
#define RXF4EIDH_EID15                2490
#define RXF4EIDL                      2491
#define RXF4EID0                      2492
#define RXF4EIDL_EID0                 2493
#define RXF4EID1                      2494
#define RXF4EIDL_EID1                 2495
#define RXF4EID2                      2496
#define RXF4EIDL_EID2                 2497
#define RXF4EID3                      2498
#define RXF4EIDL_EID3                 2499
#define RXF4EID4                      2500
#define RXF4EIDL_EID4                 2501
#define RXF4EID5                      2502
#define RXF4EIDL_EID5                 2503
#define RXF4EID6                      2504
#define RXF4EIDL_EID6                 2505
#define RXF4EID7                      2506
#define RXF4EIDL_EID7                 2507
#define RXF5SIDH                      2508
#define RXF5SIDH_SID3                 2509
#define RXF5SID3                      2510
#define RXF5SIDH_SID4                 2511
#define RXF5SID4                      2512
#define RXF5SIDH_SID5                 2513
#define RXF5SID5                      2514
#define RXF5SIDH_SID6                 2515
#define RXF5SID6                      2516
#define RXF5SIDH_SID7                 2517
#define RXF5SID7                      2518
#define RXF5SIDH_SID8                 2519
#define RXF5SID8                      2520
#define RXF5SIDH_SID9                 2521
#define RXF5SID9                      2522
#define RXF5SIDH_SID10                2523
#define RXF5SID10                     2524
#define RXF5SIDL                      2525
#define RXF5EID16                     2526
#define RXF5SIDL_EID16                2527
#define RXF5EID17                     2528
#define RXF5SIDL_EID17                2529
#define RXF5SIDL_EXIDEN               2530
#define RXF5EXIDEN                    2531
#define RXF5SIDL_EXIDE                2532
#define RXF5SIDL_SID0                 2533
#define RXF5SID0                      2534
#define RXF5SID1                      2535
#define RXF5SIDL_SID1                 2536
#define RXF5SIDL_SID2                 2537
#define RXF5SID2                      2538
#define RXF5EIDH                      2539
#define RXF5EIDH_EID8                 2540
#define RXF5EID8                      2541
#define RXF5EIDH_EID9                 2542
#define RXF5EID9                      2543
#define RXF5EIDH_EID10                2544
#define RXF5EID10                     2545
#define RXF5EIDH_EID11                2546
#define RXF5EID11                     2547
#define RXF5EIDH_EID12                2548
#define RXF5EID12                     2549
#define RXF5EIDH_EID13                2550
#define RXF5EID13                     2551
#define RXF5EIDH_EID14                2552
#define RXF5EID14                     2553
#define RXF5EIDH_EID15                2554
#define RXF5EID15                     2555
#define RXF5EIDL                      2556
#define RXF5EIDL_EID0                 2557
#define RXF5EID0                      2558
#define RXF5EIDL_EID1                 2559
#define RXF5EID1                      2560
#define RXF5EIDL_EID2                 2561
#define RXF5EID2                      2562
#define RXF5EIDL_EID3                 2563
#define RXF5EID3                      2564
#define RXF5EIDL_EID4                 2565
#define RXF5EID4                      2566
#define RXF5EIDL_EID5                 2567
#define RXF5EID5                      2568
#define RXF5EIDL_EID6                 2569
#define RXF5EID6                      2570
#define RXF5EIDL_EID7                 2571
#define RXF5EID7                      2572
#define RXM0SIDH                      2573
#define RXM0SIDH_SID3                 2574
#define RXM0SID3                      2575
#define RXM0SIDH_SID4                 2576
#define RXM0SID4                      2577
#define RXM0SIDH_SID5                 2578
#define RXM0SID5                      2579
#define RXM0SIDH_SID6                 2580
#define RXM0SID6                      2581
#define RXM0SIDH_SID7                 2582
#define RXM0SID7                      2583
#define RXM0SIDH_SID8                 2584
#define RXM0SID8                      2585
#define RXM0SIDH_SID9                 2586
#define RXM0SID9                      2587
#define RXM0SID10                     2588
#define RXM0SIDH_SID10                2589
#define RXM0SIDL                      2590
#define RXM0SIDL_EID16                2591
#define RXM0EID16                     2592
#define RXM0EID17                     2593
#define RXM0SIDL_EID17                2594
#define RXM0SIDL_EXIDEN               2595
#define RXM0EXIDM                     2596
#define RXM0SID0                      2597
#define RXM0SIDL_SID0                 2598
#define RXM0SID1                      2599
#define RXM0SIDL_SID1                 2600
#define RXM0SID2                      2601
#define RXM0SIDL_SID2                 2602
#define RXM0EIDH                      2603
#define RXM0EIDH_EID8                 2604
#define RXM0EID8                      2605
#define RXM0EIDH_EID9                 2606
#define RXM0EID9                      2607
#define RXM0EIDH_EID10                2608
#define RXM0EID10                     2609
#define RXM0EIDH_EID11                2610
#define RXM0EID11                     2611
#define RXM0EIDH_EID12                2612
#define RXM0EID12                     2613
#define RXM0EIDH_EID13                2614
#define RXM0EID13                     2615
#define RXM0EIDH_EID14                2616
#define RXM0EID14                     2617
#define RXM0EIDH_EID15                2618
#define RXM0EID15                     2619
#define RXM0EIDL                      2620
#define RXM0EIDL_EID0                 2621
#define RXM0EID0                      2622
#define RXM0EIDL_EID1                 2623
#define RXM0EID1                      2624
#define RXM0EIDL_EID2                 2625
#define RXM0EID2                      2626
#define RXM0EIDL_EID3                 2627
#define RXM0EID3                      2628
#define RXM0EIDL_EID4                 2629
#define RXM0EID4                      2630
#define RXM0EIDL_EID5                 2631
#define RXM0EID5                      2632
#define RXM0EIDL_EID6                 2633
#define RXM0EID6                      2634
#define RXM0EIDL_EID7                 2635
#define RXM0EID7                      2636
#define RXM1SIDH                      2637
#define RXM1SID3                      2638
#define RXM1SIDH_SID3                 2639
#define RXM1SID4                      2640
#define RXM1SIDH_SID4                 2641
#define RXM1SID5                      2642
#define RXM1SIDH_SID5                 2643
#define RXM1SID6                      2644
#define RXM1SIDH_SID6                 2645
#define RXM1SID7                      2646
#define RXM1SIDH_SID7                 2647
#define RXM1SIDH_SID8                 2648
#define RXM1SID8                      2649
#define RXM1SID9                      2650
#define RXM1SIDH_SID9                 2651
#define RXM1SIDH_SID10                2652
#define RXM1SID10                     2653
#define RXM1SIDL                      2654
#define RXM1SIDL_EID16                2655
#define RXM1EID16                     2656
#define RXM1SIDL_EID17                2657
#define RXM1EID17                     2658
#define RXM1SIDL_EXIDEN               2659
#define RXM1EXIDEN                    2660
#define RXM1SID0                      2661
#define RXM1SIDL_SID0                 2662
#define RXM1SID1                      2663
#define RXM1SIDL_SID1                 2664
#define RXM1SID2                      2665
#define RXM1SIDL_SID2                 2666
#define RXM1EIDH                      2667
#define RXM1EID8                      2668
#define RXM1EIDH_EID8                 2669
#define RXM1EID9                      2670
#define RXM1EIDH_EID9                 2671
#define RXM1EIDH_EID10                2672
#define RXM1EID10                     2673
#define RXM1EIDH_EID11                2674
#define RXM1EID11                     2675
#define RXM1EIDH_EID12                2676
#define RXM1EID12                     2677
#define RXM1EIDH_EID13                2678
#define RXM1EID13                     2679
#define RXM1EIDH_EID14                2680
#define RXM1EID14                     2681
#define RXM1EIDH_EID15                2682
#define RXM1EID15                     2683
#define RXM1EIDL                      2684
#define RXM1EID0                      2685
#define RXM1EIDL_EID0                 2686
#define RXM1EID1                      2687
#define RXM1EIDL_EID1                 2688
#define RXM1EID2                      2689
#define RXM1EIDL_EID2                 2690
#define RXM1EID3                      2691
#define RXM1EIDL_EID3                 2692
#define RXM1EIDL_EID4                 2693
#define RXM1EID4                      2694
#define RXM1EIDL_EID5                 2695
#define RXM1EID5                      2696
#define RXM1EID6                      2697
#define RXM1EIDL_EID6                 2698
#define RXM1EID7                      2699
#define RXM1EIDL_EID7                 2700
#define TXB2CON                       2701
#define TXB2CON_TXPRI0                2702
#define TXB2PRI0                      2703
#define TXB2CON_TXPRI1                2704
#define TXB2PRI1                      2705
#define TXB2REQ                       2706
#define TXB2CON_TXREQ                 2707
#define TXB2CON_TXERR                 2708
#define TXB2ERR                       2709
#define TXB2CON_TXLARB                2710
#define TXB2LARB                      2711
#define TXB2ABT                       2712
#define TXB2CON_TXABT                 2713
#define TXBIFBXB2CON                  2714
#define TXB2CON_TXBIF                 2715
#define TX2IF                         2716
#define TXB2SIDH                      2717
#define TXB2SID3                      2718
#define TXB2SIDH_SID3                 2719
#define TXB2SID4                      2720
#define TXB2SIDH_SID4                 2721
#define TXB2SID5                      2722
#define TXB2SIDH_SID5                 2723
#define TXB2SID6                      2724
#define TXB2SIDH_SID6                 2725
#define TXB2SID7                      2726
#define TXB2SIDH_SID7                 2727
#define TXB2SID8                      2728
#define TXB2SIDH_SID8                 2729
#define TXB2SID9                      2730
#define TXB2SIDH_SID9                 2731
#define TXB2SIDH_SID10                2732
#define TXB2SID10                     2733
#define TXB2SIDL                      2734
#define TXB2SIDL_EID16                2735
#define TXB2EID16                     2736
#define TXB2SIDL_EID17                2737
#define TXB2EID17                     2738
#define TXB2EXIDE                     2739
#define TXB2SIDL_EXIDE                2740
#define TXB2SIDL_SID0                 2741
#define TXB2SID0                      2742
#define TXB2SIDL_SID1                 2743
#define TXB2SID1                      2744
#define TXB2SIDL_SID2                 2745
#define TXB2SID2                      2746
#define TXB2EIDH                      2747
#define TXB2EIDH_EID8                 2748
#define TXB2EID8                      2749
#define TXB2EIDH_EID9                 2750
#define TXB2EID9                      2751
#define TXB2EIDH_EID10                2752
#define TXB2EID10                     2753
#define TXB2EIDH_EID11                2754
#define TXB2EID11                     2755
#define TXB2EIDH_EID12                2756
#define TXB2EID12                     2757
#define TXB2EIDH_EID13                2758
#define TXB2EID13                     2759
#define TXB2EIDH_EID14                2760
#define TXB2EID14                     2761
#define TXB2EIDH_EID15                2762
#define TXB2EID15                     2763
#define TXB2EIDL                      2764
