tiborsimon/embedded-tdd-headers/pic/8bit/pic18f4580_tdd.h
#define LVDL3                         4439
#define HLVDEN                        4440
#define LVDEN                         4441
#define BGST                          4442
#define IRVST                         4443
#define IVRST                         4444
#define VDIRMAG                       4445
#define OSCCON                        4446
#define SCS0                          4447
#define SCS                           4448
#define SCS1                          4449
#define IOFS                          4450
#define OSTS                          4451
#define IRCF                          4452
#define IRCF0                         4453
#define IRCF1                         4454
#define IRCF2                         4455
#define IDLEN                         4456
#define T0CON                         4457
#define T0PS                          4458
#define T0PS0                         4459
#define T0PS1                         4460
#define T0PS2                         4461
#define PSA                           4462
#define T0PS3                         4463
#define T0SE                          4464
#define T0CS                          4465
#define T08BIT                        4466
#define TMR0ON                        4467
#define STATUS                        4468
#define C                             4469
#define CARRY                         4470
#define DC                            4471
#define ZERO                          4472
#define Z                             4473
#define OV                            4474
#define OVERFLOW                      4475
#define N                             4476
#define NEGATIVE                      4477
#define INTCON3                       4478
#define INT1IF                        4479
#define INT1F                         4480
#define INT2IF                        4481
#define INT2F                         4482
#define INT1E                         4483
#define INT1IE                        4484
#define INT2IE                        4485
#define INT2E                         4486
#define INT1P                         4487
#define INT1IP                        4488
#define INT2IP                        4489
#define INT2P                         4490
#define INTCON2                       4491
#define RBIP                          4492
#define TMR0IP                        4493
#define T0IP                          4494
#define INTEDG2                       4495
#define INTEDG1                       4496
#define INTEDG0                       4497
#define RBPU                          4498
#define NOT_RBPU                      4499
#define nRBPU                         4500
#define INTCON                        4501
#define RBIF                          4502
#define INT0F                         4503
#define INT0IF                        4504
#define T0IF                          4505
#define TMR0IF                        4506
#define RBIE                          4507
#define INT0E                         4508
#define INT0IE                        4509
#define T0IE                          4510
#define TMR0IE                        4511
#define PEIE                          4512
#define PEIE_GIEL                     4513
#define GIEL                          4514
#define GIE_GIEH                      4515
#define GIE                           4516
#define GIEH                          4517
#define STKPTR0                       4518
#define STKPTR                        4519
#define STKPTR1                       4520
#define STKPTR2                       4521
#define STKPTR3                       4522
#define STKPTR4                       4523
#define STKUNF                        4524
#define STKOVF                        4525
#define STKFUL                        4526

#endif // _PIC18F4580_H_
